RemoteScriptHandler.handle({
    "description": "Imate 3D prostor dimenzija X, Y i Z, predstavljen ćelijama (u daljem tekstu, voxelima). Ćelije mogu da budu u dva stanja, prazne I popunjene. Vaš zadatak je da u tom prostoru pronadjete I ispišete sva izolovana ostrva.<br><br>Pod ostrvom se podrazumeva jedan, ili grupa voxela koja ni na koji način nije povezana sa nekom drugom grupom (razdvojeni su praznim prostorom).<br><br>Dva voxela su povezana ukoliko su susedni po osama ili po dijagonalama. Na primer, u najvećem slučaju, obzirom da se radi o 3D prostoru, jedan voxel okružuje 26 drugih voxela. Ukoliko je neki od tih voxela popunjen, smatra se susedom.<br><br><img src='http://i43.tinypic.com/106y4cl.png' /><br>Primer sa slike demonstrira voxel (crveni) okruženu sa 19 drugih (plavi).",
    "submissions": ".exe fajl sa vašim rešenjem možete postaviti na forum, ili poslati mailom na programming.challenges.sk@gmail.com .<br><br> Rezultati će biti objavljeni na kraju challenge-a, bodovaće se broj uspešno rešenih testova kao I tačnost rešenja. Vremenski limit neće ulaziti u ocenu, ali će postojati gornja granica u zavisnosti od dimenzija prostora.",
    "input": "Podaci se čitaju sa standardnog ulaza. Prva linija sadrži tri pozitivna cela broja: X, Y i Z, koji predstavljaju dimenzije prostora. Slede podaci o sadržaju prostora. <br><br>Podaci se sastoje od niza X*Y matrica, od kojih svaka prestavlja jedan horizontalni nivo datog prostora. Broj takvih matrica je predstavljen vrednošću parametra Z. Matrice su razdvojene praznim redom.<br><br>Matrice sadrže jedan od dva elementa, {1 ili 0}, koji označavaju da li je voxel na tom mestu popunjen ili ne.",
    "output": "Na standardnom izlazu ispisati sledeće:<br><br>U prvom redu broj pronadjenih ostrva.<br><br>U svakom sledećem broj voxela u pronadjenim ostrvima, sortirano u opadajucem redosledu.",
    "limits": "<strong>1 <= X, Y, Z <= 1000</strong><br><strong>X * Y * Z <= 100 000 000</strong><br><br>Ulaz ne treba proveravati, uvek će biti validan.",
    "samples": [
        {
            "input": "5 5 5\n1 0 0 0 1\n0 0 0 0 0\n0 0 0 0 0\n0 0 0 0 0\n1 0 0 0 1\n\n0 0 0 0 0\n0 0 0 0 0\n0 0 1 0 0\n0 0 0 0 0\n0 0 0 0 0\n\n0 0 0 0 0\n0 0 1 0 0\n0 1 1 1 0\n0 0 1 0 0\n0 0 0 0 0\n\n0 0 0 0 0\n0 0 0 0 0\n0 0 1 0 0\n0 0 0 0 0\n0 0 0 0 0\n\n1 0 0 0 1\n0 0 0 0 0\n0 0 0 0 0\n0 0 0 0 0\n1 0 0 0 1",
            "output": "9\n7\n1\n1\n1\n1\n1\n1\n1\n1"
        }
    ],
    "explanation": "<h4>Objašnjenje:</h4><p>Ovaj primer se vrlo lako može predstaviti vizuelno:</p><img src='http://i40.tinypic.com/68txqa.png'> <p>Ukoliko pogledamo ulaz, vidimo da je u pitanju prostor dimenzija 5x5x5. Podaci su organizovani u 5 matrica po 5x5 elemenata (slojevi poređani po visini), što daje ukupno 125 mogućih elemenata.</p><p>Ovde je lako videti da se imamo 8 samostalnih voxela koji nisu povezani ni sa čim (narandžasto), kao i jedan centralni objekat koji se stastoji od 7 voxela (plavo, centralni voxel postoji, iako se ne vidi na slici), što daje ukupno 9 ostrva, sa njihovim veličinama datim u izlazu primera.</p>"
});
